// src/data/categories.js

const categories = [
  {
    name: "Εστίαση",
    subcategories: [
      "Εστιατόρια",
      "Καφετέριες",
      "Μπαρ",
      "Πιτσαρίες",
      "Ταχυφαγεία",
      "Ζαχαροπλαστεία",
      "Κρεπερί",
      "Παραδοσιακή κουζίνα"
    ]
  },
  {
    name: "Υγεία & Ομορφιά",
    subcategories: [
      "Κομμωτήρια",
      "Κέντρα αισθητικής",
      "Γυμναστήρια",
      "Φαρμακεία",
      "Οδοντιατρεία",
      "Ιατρεία",
      "Μασάζ"
    ]
  },
  {
    name: "Καταστήματα",
    subcategories: [
      "Ένδυση",
      "Υπόδηση",
      "Ηλεκτρονικά",
      "Έπιπλα",
      "Παιχνίδια",
      "Βιβλιοπωλεία",
      "Καλλυντικά"
    ]
  },
  {
    name: "Υπηρεσίες",
    subcategories: [
      "Νομικές υπηρεσίες",
      "Λογιστικά γραφεία",
      "Καθαρισμοί",
      "Μεταφορές",
      "Τεχνικές Υπηρεσίες",
      "Εκπαίδευση",
      "Φροντιστήρια"
    ]
  },
  {
    name: "Αυτοκίνητα",
    subcategories: [
      "Επισκευές",
      "Πωλήσεις αυτοκινήτων",
      "Ενοικιάσεις",
      "Πλυντήρια",
      "Ανταλλακτικά"
    ]
  },
  {
    name: "Τεχνολογία",
    subcategories: [
      "Υπολογιστές",
      "Κινητά τηλέφωνα",
      "Δίκτυα",
      "Επισκευές ηλεκτρονικών",
      "Προγραμματισμός"
    ]
  },
  {
    name: "Ταξίδια & Ψυχαγωγία",
    subcategories: [
      "Ξενοδοχεία",
      "Ταξιδιωτικά γραφεία",
      "Θέατρα",
      "Κινηματογράφοι",
      "Μουσεία",
      "Σπορ"
    ]
  },
  {
    name: "Κατασκευές",
    subcategories: [
      "Αρχιτεκτονικά γραφεία",
      "Ηλεκτρολόγοι",
      "Υδραυλικοί",
      "Κατασκευαστικές εταιρείες",
      "Βιοτεχνίες"
    ]
  }
];

export default categories;
